# Taps

tap "d12frosted/emacs-plus"
tap "romkatv/powerlevel10k"
tap "azure/functions"

# Binaries

brew "libgccjit"
brew "mas"
brew "node"
brew "wget"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "romkatv/powerlevel10k/powerlevel10k"
brew "java"
brew "git-filter-repo"
brew "gh"
brew "n"
brew "watchman"
brew "tree"
brew "azure-cli"
brew "http-server"
brew "git-lfs"
brew "p7zip"
brew "cmake"
brew "bfg"
brew "yarn"

# Apps

mas "Xcode", id: 497799835
mas "Amphetamine", id: 937984704

cask "iterm2"
cask "postman"
cask "visual-studio-code"
cask "macdown"
cask "whatsapp"
cask "chatgpt"
cask "joplin"
cask "cursor"
cask "google-chrome"
cask "superwhisper"
cask "discord"
cask "signal"
cask "xscope"
