# Taps

tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "romkatv/powerlevel10k"
tap "azure/functions"

# Binaries

brew "libgccjit"
brew "mas"
brew "node"
brew "wget"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "romkatv/powerlevel10k/powerlevel10k"
brew "git-lfs"
brew "java"
brew "gitguardian/tap/ggshield"
brew "git-filter-repo"
brew "github"
brew "gh"
brew "n"
brew "watchman"
brew "tree"
brew "azure-cli"
brew "libpq"
brew "http-server"
brew "git-lfs"
brew "p7zip"
brew "cmake"
brew "azure-functions-core-tools@4"

# Apps

mas "Xcode", id: 497799835
mas "Amphetamine", id: 937984704

cask "android-studio"
cask "iterm2"
cask "krisp"
cask "postman"
cask "visual-studio-code"
cask "macdown"
cask "whatsapp"
cask "firefox"
cask "zulu11"
cask "background-music"
