# Taps

tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "romkatv/powerlevel10k"

# Binaries

brew "libgccjit"
brew "mas"
brew "node"
brew "wget"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "romkatv/powerlevel10k/powerlevel10k"
brew "git-lfs"
brew "java"
brew "gitguardian/tap/ggshield"
brew "git-filter-repo"

# Apps

mas "Xcode", id: 497799835
mas "Amphetamine", id: 937984704

cask "android-studio"
cask "iterm2"
cask "krisp"
cask "postman"
cask "visual-studio-code"
cask "macdown"
cask "whatsapp"
